title: Kerberoasting RC4 Ticket Request
id: 977bd505-9f84-482f-9271-dcd5f997704c
status: experimental
description: Detects Kerberoasting by identifying RC4-HMAC (0x17) encrypted Kerberos service ticket requests indicating offline cracking attempt.
references:
  - https://attack.mitre.org/techniques/T1558/003/
  - DH-002
author: Michael Stewart
date: 2026-03-26
logsource:
  product: windows
  service: security
detection:
  selection:
    EventID: 4769
    TicketEncryptionType: '0x17'
    TicketOptions: '0x40810000'
  filter_computers:
    ServiceName|endswith: '$'
  condition: selection and not filter_computers
falsepositives:
  - Legacy systems that only support RC4
level: high
tags:
  - attack.credential_access
  - attack.t1558.003
  - DH-002
