title: Password Spray Attack Multiple Accounts
id: 51cdb55e-4ff7-45f2-b93e-c9b103fd5c74
status: experimental
description: Detects password spraying via failed logon attempts across multiple distinct accounts from single source IP.
references:
  - https://attack.mitre.org/techniques/T1110/003/
  - DH-010
author: Michael Stewart
date: 2026-03-26
logsource:
  product: windows
  service: security
detection:
  selection:
    EventID: 4625
    LogonType: 3
  timeframe: 10m
  condition: selection | count(TargetUserName) by IpAddress > 10
falsepositives:
  - Misconfigured service accounts
level: high
tags:
  - attack.credential_access
  - attack.t1110.003
  - DH-010
